---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarHookType.GetHookExtensionLength(Autodesk.Revit.DB.Structure.RebarBarType)
source: html/dac6ad67-c23a-c5f0-26ed-4590cbfbc275.htm
---
# Autodesk.Revit.DB.Structure.RebarHookType.GetHookExtensionLength Method

Computes the hook extension length based on current hook length

## Syntax (C#)
```csharp
public double GetHookExtensionLength(
	RebarBarType barType
)
```

## Parameters
- **barType** (`Autodesk.Revit.DB.Structure.RebarBarType`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null